KeeqRight/stm8s103k3_uart1/RN8209D.c
#include "RN8209D.h"
#include "platform_config.h"
#include "delay.h"
#include "stm32f0xx_gpio.h"
#include "global.h"
#include <math.h>  //求根号

#define USING_SOFT_SPI


#define RN8209D_CS_SET()    GPIO_SetBits(GPIOB,GPIO_Pin_5)
#define RN8209D_CS_CLR()    GPIO_ResetBits(GPIOB,GPIO_Pin_5)

#define RN8209D_SCK_SET()   GPIO_SetBits(GPIOD,GPIO_Pin_2)
#define RN8209D_SCK_CLR()   GPIO_ResetBits(GPIOD,GPIO_Pin_2)

#define RN8209D_Read_MISO() GPIO_ReadInputDataBit(GPIOB,GPIO_Pin_3)

#define RN8209D_MOSI_SET()  GPIO_SetBits(GPIOB,GPIO_Pin_4)
#define RN8209D_MOSI_CLR()  GPIO_ResetBits(GPIOB,GPIO_Pin_4)

#ifdef USE_SMARTACU110
    #define RN8209D_RST_SET()  GPIO_SetBits(GPIOC,GPIO_Pin_10)
    #define RN8209D_RST_CLR()  GPIO_ResetBits(GPIOC,GPIO_Pin_10)
#endif

#ifdef USE_SMARTACU120
    #define RN8209D_RST_SET()  GPIO_SetBits(GPIOC,GPIO_Pin_7)
    #define RN8209D_RST_CLR()  GPIO_ResetBits(GPIOC,GPIO_Pin_7)
#endif

#define RNDelay         delay_us
#define RN_CLOCKWIDTH   30


StDef_RN8209DPara StDef_RN8209DPara_Reg;

void RN8209D_GetCheckSum(void);

void RN8209D_ReadRegNoCheck(uint8_t addr,uint8_t *regbuf,uint8_t regbuflen)
{
    uint8_t ucI,ucK;

    RN8209D_CS_CLR();
    delay_us(10);
    addr |= 0x00;            //发送读数据命令(bit.7=0)
    for(ucI=0;ucI<8;ucI++)	//发送读数据命令,下降沿接收数据,高位在前，低位在后
    {
        if( addr & 0x80 )
            RN8209D_MOSI_SET();
        else
            RN8209D_MOSI_CLR();
        RN8209D_SCK_SET();
        delay_us(RN_CLOCKWIDTH);
        RN8209D_SCK_CLR();      //在时钟的下降沿写数据
        addr<<=1;
        delay_us(RN_CLOCKWIDTH);
    }
    RN8209D_MOSI_CLR();
    RN8209D_SCK_CLR();
    delay_us(50);
    for(ucK=0;ucK<regbuflen;ucK++)
    {
        regbuf[ucK]=0x00;
        for(ucI=0;ucI<8;ucI++)
        {
            RN8209D_SCK_SET();
            delay_us(RN_CLOCKWIDTH);
            regbuf[ucK]<<=1;
            RN8209D_SCK_CLR();      //在时钟的下降沿读数据
            delay_us(RN_CLOCKWIDTH/2);
            if(RN8209D_Read_MISO())
                regbuf[ucK]=regbuf[ucK]|0x01;
            delay_us(RN_CLOCKWIDTH/2);
        }
    }
    RN8209D_CS_SET();
    delay_us(10);
    RN8209D_SCK_CLR();
    delay_us(10);
}

uint8_t RN8209D_ReadReg(uint8_t addr,uint8_t *regbuf,uint8_t regbuflen)
{
    uint8_t buf[4];

    RN8209D_ReadRegNoCheck(addr,regbuf,regbuflen);
    m_memset(buf,0x01,4);
    RN8209D_ReadRegNoCheck(Reg_RData,buf,4);

    if(regbuflen == 3){
        if(m_memcmp(regbuf,buf+1,regbuflen) == 0)
            return 0;
        else
            return 1;
    }
    else if(regbuflen == 4){
        if(m_memcmp(regbuf,buf,regbuflen) == 0)
            return 0;
        else
            return 1;
    }
    else if(regbuflen == 2){
        if(m_memcmp(regbuf,buf+2,regbuflen) == 0)
            return 0;
        else
            return 1;
    }
    else{
        return 1;
    }

}

void RN8209D_WriteRegNoCheck(uint8_t addr,uint8_t *regbuf,uint8_t regbuflen)
{
    uint8_t ucI,ucK;

    RN8209D_CS_CLR();
    delay_us(100);
    addr |= 0x80;   //发送写数据命令(bit.7=1)
    for(ucI=0;ucI<8;ucI++)
    {
        if( addr & 0x80 )
            RN8209D_MOSI_SET();
        else
            RN8209D_MOSI_CLR(); ;
        RN8209D_SCK_SET();
        delay_us(RN_CLOCKWIDTH);
        RN8209D_SCK_CLR();          //在时钟的下降沿写数据
        addr<<=1;
        delay_us(RN_CLOCKWIDTH);
    }
    RN8209D_MOSI_CLR();
    RN8209D_SCK_CLR();
    delay_us(500);
    for(ucK=0;ucK<regbuflen;ucK++)
    {
        for(ucI=0;ucI<8;ucI++)
        {
            if(regbuf[ucK] & 0x80 )
                RN8209D_MOSI_SET();
            else
                RN8209D_MOSI_CLR();
            RN8209D_SCK_SET();
            delay_us(RN_CLOCKWIDTH);
            RN8209D_SCK_CLR();      //在时钟的下降沿写数据
            regbuf[ucK]<<=1;
            delay_us(RN_CLOCKWIDTH);
        }
    }
    RN8209D_MOSI_CLR();
    delay_us(100);
    RN8209D_CS_SET();
    delay_us(100);
    RN8209D_SCK_CLR();
    delay_us(100);
}

uint8_t RN8209D_WriteReg(uint8_t addr,uint8_t *regbuf,uint8_t regbuflen)
{
    uint8_t buf[4];

    RN8209D_WriteRegNoCheck(addr,regbuf,regbuflen);
    m_memset(buf,0,4);
    RN8209D_WriteRegNoCheck(Reg_WData,buf,regbuflen);

    if(regbuflen == 3){
        if(m_memcmp(regbuf,buf+1,regbuflen) == 0)
            return 0;
        else
            return 1;
    }
    else if(regbuflen == 4){
        if(m_memcmp(regbuf,buf,regbuflen) == 0)
            return 0;
        else
            return 1;
    }
    else if(regbuflen == 2){
        if(m_memcmp(regbuf,buf+2,regbuflen) == 0)
            return 0;
        else
            return 1;
    }
    else{
        return 1;
    }
}

static void RN8209D_GPIOConfig(void)
{
    GPIO_InitTypeDef GPIO_InitStructure;

    RCC_AHBPeriphClockCmd(RCC_AHBPeriph_GPIOB|RCC_AHBPeriph_GPIOC|RCC_AHBPeriph_GPIOD,ENABLE);

    /* SCLK */
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_2;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
    GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;//GPIO_OType_PP;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;//GPIO_PuPd_NOPULL;//;
    GPIO_Init(GPIOD, &GPIO_InitStructure);

    /* CS MOSI */
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_4|GPIO_Pin_5;
    GPIO_Init(GPIOB, &GPIO_InitStructure);

#ifdef USE_SMARTACU110
    /* RST */
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_10;
    GPIO_SetBits(GPIOC,GPIO_Pin_10);            //没有这条语句，会导致初始化后端口输出电平为0
    GPIO_Init(GPIOC, &GPIO_InitStructure);
#endif

#ifdef USE_SMARTACU120
    /* RST */
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_7;
    GPIO_Init(GPIOC, &GPIO_InitStructure);
#endif

    /* MISO */
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_3;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN;
    GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;
    GPIO_Init(GPIOB, &GPIO_InitStructure);

