KeeqRight/stm8s103k3_uart1/RN8209D.c
}

/********************************************************
功能描述：   读取00H~17H寄存器校验和
参数说明：
返回说明：
调用方式：
全局变量：
读写时间：
注意事项：
日期    ：
********************************************************/
void RN8209D_GetCheckSum(void)
{

    uint16_t regbuf[24],i;

    //00H 系统控制寄存器
    regbuf[0] = 0x0051;
    //01H 计量控制
    regbuf[1] = 0x8003;  //电能读后清零
    //02H 写HFCONST
    regbuf[2] = 0x357B;
    //03H,04H启动功率
    regbuf[3] = 0x012D;
    regbuf[4] = 0x012D;
    //05H A通道有功功率增益;
    regbuf[5] = StDef_RN8209DPara_Reg.Cst_GPQA;
    //06HB通道有功功率增益
    regbuf[6] = StDef_RN8209DPara_Reg.Cst_GPQB;
    //07H A通道相位校正
    regbuf[7] = StDef_RN8209DPara_Reg.Cst_PhsA;
    //08 B通道相位校正
    regbuf[8] = StDef_RN8209DPara_Reg.Cst_PhsB;
    //09 无功相位补偿
    regbuf[9] = 0;
    //0AH A通道有功功率offset
    regbuf[10] = StDef_RN8209DPara_Reg.Cst_APOSA;
    //0BH B通道有功功率offset
    regbuf[11] = StDef_RN8209DPara_Reg.Cst_APOSB;
    //0CH A通道无功功率offset
    regbuf[12] = StDef_RN8209DPara_Reg.Cst_RPOSA;
    //0DH B通道无功功率offset
    regbuf[13] = StDef_RN8209DPara_Reg.Cst_RPOSB;
    //0EH A通道电流offset
    regbuf[14] = StDef_RN8209DPara_Reg.Cst_IARMSOS;
    //0FH B通道电流offset
    regbuf[15] = StDef_RN8209DPara_Reg.Cst_IBRMSOS;
    //10H B通道电流增益
    regbuf[16] = StDef_RN8209DPara_Reg.Cst_IBGain;
    //11H 无功相位补偿
    regbuf[17] = 0;
    //12H 无功相位补偿
    regbuf[18] = 0;
    //13H 无功相位补偿
    regbuf[19] = 0;
    //14H 无功相位补偿
    regbuf[20] = 0;
    //15H 无功相位补偿
    regbuf[21] = 0;
    //16H 无功相位补偿
    regbuf[22] = 0;
    //17H 计量控制2
    regbuf[23] = 0x00B0;

    StDef_RN8209DPara_Reg.cheskSum = 0;
    for(i=0;i<24;i++){
        StDef_RN8209DPara_Reg.cheskSum += regbuf[i];
    }
    StDef_RN8209DPara_Reg.cheskSum = ~StDef_RN8209DPara_Reg.cheskSum;
}


uint8_t RN8209D_Init(void)
{
    uint8_t regbuf[4];
    uint8_t status = 1;

    RN8209D_GPIOConfig();

    RN8209D_RST_CLR();
    delay_ms(100);
    RN8209D_RST_SET();
    delay_ms(100);

    //读取RN8209 DeviceID
    if(RN8209D_ReadReg(Reg_DeviceID,regbuf,3) == 0)
    {
        if((regbuf[0]==0x82)&&(regbuf[1]==0x09)&&(regbuf[2]==0x00)){
            status = 0;
        }
        else{
            status = 1;
        }
    }

    //默认换算系数
    //StDef_RN8209DPara_Reg.Cst_Kia = 41938;
    //StDef_RN8209DPara_Reg.Cst_Kib = 44529;
    //StDef_RN8209DPara_Reg.Cst_Ku  = 8711;

    if(status == 0)
    {
        //写使能
        regbuf[0] = 0xE5;
        RN8209D_WriteReg(WREN,regbuf,1);
        //复位
        regbuf[0] = 0xFA;
        RN8209D_WriteReg(WREN,regbuf,1);
        delay_ms(20);
        //写使能
        regbuf[0] = 0xE5;
        RN8209D_WriteReg(WREN,regbuf,1);
        //系统控制寄存器
        regbuf[0] = 0x00;
        regbuf[1] = 0x51;  //开启通道B,A、B通道增益2
        RN8209D_WriteReg(Reg_SYSCON,regbuf,2);
        m_memset(regbuf,0,2);
        RN8209D_ReadReg(Reg_SYSCON,regbuf,2);
        //写HFCONST
        regbuf[0] = 0x35;
        regbuf[1] = 0x7B;
        RN8209D_WriteReg(Reg_HFCONST,regbuf,2);
        m_memset(regbuf,0,2);
        RN8209D_ReadReg(Reg_HFCONST,regbuf,2);
        //启动功率
        regbuf[0] = 0x01;
        regbuf[1] = 0x2D;
        RN8209D_WriteReg(Reg_PStart,regbuf,2);
        regbuf[0] = 0x01;
        regbuf[1] = 0x2D;
        RN8209D_WriteReg(Reg_DStart,regbuf,2);
        //计量控制
        regbuf[0] = 0x80;  //电能读后清零
        regbuf[1] = 0x03;
        RN8209D_WriteReg(Reg_EMUCON,regbuf,2);
        //计量控制2
        regbuf[0] = 0x00;
        regbuf[1] = 0xB0;
        RN8209D_WriteReg(Reg_EMUCON2,regbuf,2);
        //A通道有功功率增益
        //StDef_RN8209DPara_Reg.Cst_GPQA = 0;
        regbuf[0] = StDef_RN8209DPara_Reg.Cst_GPQA/256;
        regbuf[1] = StDef_RN8209DPara_Reg.Cst_GPQA%256;
        RN8209D_WriteReg(Reg_GPQA,regbuf,2);
        //B通道有功功率增益
        //StDef_RN8209DPara_Reg.Cst_GPQB = 0;
        regbuf[0] = StDef_RN8209DPara_Reg.Cst_GPQB/256;
        regbuf[1] = StDef_RN8209DPara_Reg.Cst_GPQB%256;
        RN8209D_WriteReg(Reg_GPQB,regbuf,2);
        //A通道相位校正
        //StDef_RN8209DPara_Reg.Cst_PhsA = 0;
        regbuf[0] = StDef_RN8209DPara_Reg.Cst_PhsA;
        RN8209D_WriteReg(Reg_PhsA,regbuf,1);
        //B通道相位校正
        //StDef_RN8209DPara_Reg.Cst_PhsB = 0;
        regbuf[0] = StDef_RN8209DPara_Reg.Cst_PhsB;
        RN8209D_WriteReg(Reg_PhsB,regbuf,1);
        //A通道有功功率offset
        //StDef_RN8209DPara_Reg.Cst_APOSA = 0;
        regbuf[0] = StDef_RN8209DPara_Reg.Cst_APOSA/256;
        regbuf[1] = StDef_RN8209DPara_Reg.Cst_APOSA%256;
        RN8209D_WriteReg(Reg_APOSA,regbuf,2);
        //B通道有功功率offset
        //StDef_RN8209DPara_Reg.Cst_APOSB = 0;
        regbuf[0] = StDef_RN8209DPara_Reg.Cst_APOSB/256;
        regbuf[1] = StDef_RN8209DPara_Reg.Cst_APOSB%256;
        RN8209D_WriteReg(Reg_APOSB,regbuf,2);
        //A通道无功功率offset
        StDef_RN8209DPara_Reg.Cst_RPOSA = 0;
        regbuf[0] = StDef_RN8209DPara_Reg.Cst_RPOSA/256;
        regbuf[1] = StDef_RN8209DPara_Reg.Cst_RPOSA%256;
        RN8209D_WriteReg(Reg_RPOSA,regbuf,2);
        //B通道无功功率offset
        StDef_RN8209DPara_Reg.Cst_RPOSB = 0;
        regbuf[0] = StDef_RN8209DPara_Reg.Cst_RPOSB/256;
        regbuf[1] = StDef_RN8209DPara_Reg.Cst_RPOSB%256;
        RN8209D_WriteReg(Reg_RPOSB,regbuf,2);
        //A通道电流offset
        //StDef_RN8209DPara_Reg.Cst_IARMSOS = 0;
        regbuf[0] = StDef_RN8209DPara_Reg.Cst_IARMSOS/256;
        regbuf[1] = StDef_RN8209DPara_Reg.Cst_IARMSOS%256;
        RN8209D_WriteReg(Reg_IARMSOS,regbuf,2);
        //B通道电流offset
        //StDef_RN8209DPara_Reg.Cst_IBRMSOS = 0;
        regbuf[0] = StDef_RN8209DPara_Reg.Cst_IBRMSOS/256;
        regbuf[1] = StDef_RN8209DPara_Reg.Cst_IBRMSOS%256;
        RN8209D_WriteReg(Reg_IBRMSOS,regbuf,2);
        //B通道电流增益
        StDef_RN8209DPara_Reg.Cst_IBGain = 0;
        regbuf[0] = StDef_RN8209DPara_Reg.Cst_IBGain/256;
        regbuf[1] = StDef_RN8209DPara_Reg.Cst_IBGain%256;
        RN8209D_WriteReg(Reg_IBGain,regbuf,2);
        //直流通道
        regbuf[0]=0;regbuf[1]=0;
        RN8209D_WriteReg(Reg_D2FPL,regbuf,2);
        regbuf[0]=0;regbuf[1]=0;
        RN8209D_WriteReg(Reg_D2FPH,regbuf,2);
        regbuf[0]=0;regbuf[1]=0;
        RN8209D_WriteReg(Reg_DCIAH,regbuf,2);
        regbuf[0]=0;regbuf[1]=0;
        RN8209D_WriteReg(Reg_DCIBH,regbuf,2);
        regbuf[0]=0;regbuf[1]=0;
        RN8209D_WriteReg(Reg_DCUH,regbuf,2);
        regbuf[0]=0;regbuf[1]=0;
        RN8209D_WriteReg(Reg_DCL,regbuf,2);
        //写保护
        regbuf[0] = 0xDC;
        RN8209D_WriteReg(WREN,regbuf,1);
        //获取校表寄存器校验值
        RN8209D_GetCheckSum();
    }

