KeeqRight/stm8s103k3_uart1/RN8209D.c
    return status;
}

void RN8209D_CalibrateInit(void)
{
    uint8_t regbuf[4];
    uint8_t status = 1;

    //读取RN8209 DeviceID
    if(RN8209D_ReadReg(Reg_DeviceID,regbuf,3) == 0){
        if((regbuf[0]==0x82)&&(regbuf[1]==0x09)&&(regbuf[2]==0x00)){
            status = 0;
        }
        else{
            status = 1;
        }
    }

    //默认换算系数
    //StDef_RN8209DPara_Reg.Cst_Kia = 41938;
    //StDef_RN8209DPara_Reg.Cst_Kib = 44529;
    //StDef_RN8209DPara_Reg.Cst_Ku = 8711;
    if(status == 0){
        //写使能
        regbuf[0] = 0xE5;
        RN8209D_WriteReg(WREN,regbuf,1);
        //复位
        regbuf[0] = 0xFA;
        RN8209D_WriteReg(WREN,regbuf,1);
        delay_ms(20);
        //写使能
        regbuf[0] = 0xE5;
        RN8209D_WriteReg(WREN,regbuf,1);
        //系统控制寄存器
        regbuf[0] = 0x00;
        regbuf[1] = 0x51;  //开启通道B
        RN8209D_WriteReg(Reg_SYSCON,regbuf,2);
        m_memset(regbuf,0,2);
        RN8209D_ReadReg(Reg_SYSCON,regbuf,2);
        //写HFCONST
        regbuf[0] = 0x35;
        regbuf[1] = 0x7B;
        RN8209D_WriteReg(Reg_HFCONST,regbuf,2);
        m_memset(regbuf,0,2);
        RN8209D_ReadReg(Reg_HFCONST,regbuf,2);
        //启动功率
        regbuf[0] = 0x01;
        regbuf[1] = 0x2D;
        RN8209D_WriteReg(Reg_PStart,regbuf,2);
        regbuf[0] = 0x01;
        regbuf[1] = 0x2D;
        RN8209D_WriteReg(Reg_DStart,regbuf,2);
        //计量控制
        regbuf[0] = 0x80;  //电能读后清零
        regbuf[1] = 0x03;
        RN8209D_WriteReg(Reg_EMUCON,regbuf,2);
        //计量控制2
        regbuf[0] = 0x00;
        regbuf[1] = 0xB0;  //自定义电能寄存器为B通道
        RN8209D_WriteReg(Reg_EMUCON2,regbuf,2);
        //B通道电流增益
        regbuf[0] = 0;
        regbuf[1] = 0;
        RN8209D_WriteReg(Reg_IBGain,regbuf,2);
        //A通道有功功率增益
        regbuf[0] = 0;
        regbuf[1] = 0;
        RN8209D_WriteReg(Reg_GPQA,regbuf,2);
        //B通道有功功率增益
        regbuf[0] = 0;
        regbuf[1] = 0;
        RN8209D_WriteReg(Reg_GPQB,regbuf,2);
        //A通道相位校正
        regbuf[0] = 0;
        RN8209D_WriteReg(Reg_PhsA,regbuf,1);
        //B通道相位校正
        regbuf[0] = 0;
        RN8209D_WriteReg(Reg_PhsB,regbuf,1);
        //A通道有功功率offset
        regbuf[0] = 0;
        regbuf[1] = 0;
        RN8209D_WriteReg(Reg_APOSA,regbuf,2);
        //B通道有功功率offset
        regbuf[0] = 0;
        regbuf[1] = 0;
        RN8209D_WriteReg(Reg_APOSB,regbuf,2);
        //A通道无功功率offset
        regbuf[0] = 0;
        regbuf[1] = 0;
        RN8209D_WriteReg(Reg_RPOSA,regbuf,2);
        //B通道无功功率offset
        regbuf[0] = 0;
        regbuf[1] = 0;
        RN8209D_WriteReg(Reg_RPOSB,regbuf,2);
        //A通道电流offset
        regbuf[0] = 0;
        regbuf[1] = 0;
        RN8209D_WriteReg(Reg_IARMSOS,regbuf,2);
        //B通道电流offset
        regbuf[0] = 0;
        regbuf[1] = 0;
        RN8209D_WriteReg(Reg_IBRMSOS,regbuf,2);
        //校表时不要写保护

    }
}

/********************************************************
功能描述：   误差法校准功率增益
参数说明：
返回说明：
调用方式：
全局变量：
读写时间：
注意事项：
日期    ：
********************************************************/
void RN8209D_CalibrateGPQxErr(uint8_t phase,int16_t err)
{
    const uint16_t regGPx[]={Reg_GPQA,Reg_GPQB};
    const uint16_t regArry[]={Reg_PowerPA,Reg_PowerPB};
    uint8_t regbuf[5];
    float k = 0;
    uint16_t GPQx;
    uint16_t tempValue;

    //判断是否是负数
    if(err & 0x8000){
        err &= 0x7fff;
        err = -err;
    }

    k = (-err/10000.0)/(1+err/10000.0);
    if(k > 0){
        GPQx = (uint16_t)(k*32768);
        //写使能
        regbuf[0] = 0xE5;
        RN8209D_WriteReg(WREN,regbuf,1);
        regbuf[0] = GPQx/256;
        regbuf[1] = GPQx%256;
        RN8209D_WriteReg(regGPx[phase],regbuf,2);
    }
    else{
        GPQx = (uint16_t)(k*32768+65536);
        //写使能
        regbuf[0] = 0xE5;
        RN8209D_WriteReg(WREN,regbuf,1);
        //写寄存器
        regbuf[0] = GPQx/256;
        regbuf[1] = GPQx%256;
        RN8209D_WriteReg(regGPx[phase],regbuf,2);
        m_memset(regbuf,0x00,2);
        RN8209D_ReadReg(regGPx[phase],regbuf,2);
    }
    if(phase == phase_A){
        StDef_RN8209DPara_Reg.Cst_GPQA = GPQx;
        if(RN8209D_ReadReg(regArry[phase],regbuf,2)==0){
            tempValue = regbuf[0]*256+regbuf[1];
            //StDef_RN8209DPara_Reg.Cst_Kpa = tempValue / 1100;
        }
    }
    else if(phase == phase_B){
        StDef_RN8209DPara_Reg.Cst_GPQB = GPQx;
        if(RN8209D_ReadReg(regArry[phase],regbuf,2)==0){
            tempValue = regbuf[0]*256+regbuf[1];
            //StDef_RN8209DPara_Reg.Cst_Kpb = tempValue / 1100;
        }
    }
}

/********************************************************
功能描述：   误差法校准相位
参数说明：
返回说明：
调用方式：
全局变量：
读写时间：
注意事项：
日期    ：
********************************************************/
void RN8209D_CalibratePhsXErr(uint8_t phase,int16_t err)
{
    double k = 0;
    uint8_t phsValue = 0;
    const uint16_t regGPx[]={Reg_PhsA,Reg_PhsB};
    uint8_t regbuf[5];

    k = asin(-err/10000.0/1.732)*180/3.142;
    if(k > 0){
        phsValue = (uint8_t)(k/0.02);
    }
    else{
        phsValue = (uint8_t)(k/0.02+512);
    }
    //写使能
    regbuf[0] = 0xE5;
    RN8209D_WriteReg(WREN,regbuf,1);
    //写寄存器
    regbuf[0] = phsValue;
    RN8209D_WriteReg(regGPx[phase],regbuf,1);
    if(phase == phase_A){
        StDef_RN8209DPara_Reg.Cst_PhsA = phsValue;
    }
    else if(phase == phase_B){
        StDef_RN8209DPara_Reg.Cst_PhsB = phsValue;
    }
}

/********************************************************
功能描述：   计算有功功率offset
参数说明：
返回说明：
调用方式：
全局变量：
读写时间：
注意事项：
日期    ：
********************************************************/
//void RN8209D_CalibrateAPOSx(uint8_t phase)
//{
//    uint8_t regbuf[5];
//    uint32_t regtemp[12],regtotal=0;
//    const uint16_t regArry[]={Reg_PowerPA,Reg_PowerPB};
//    const uint16_t reg_APOSArry[]={Reg_APOSA,Reg_APOSB};
//    uint8_t i = 0;
//    uint16_t temp;

//    for(i=0;i<12;i++){
//        if(RN8209D_ReadReg(regArry[phase],regbuf,4)==0){
//            regtemp[i] = (regbuf[0]<<24)+(regbuf[1]<<16)+(regbuf[2]<<8)+(regbuf[3]);
//            //求补码
//            if(regtemp[i]&0x80000000){
//               regtemp[i] = ~regtemp[i];
//               regtemp[i] += 1;
//            }
//        }
//        delay_ms(350);
//    }
//    //第一个数据不要
//    for(i=1;i<12;i++){
//        regtotal += regtemp[i];
//    }
//    regtotal /= 11;
    
//    temp = (regtotal&0x0000FFFF);
//    //写使能
//    regbuf[0] = 0xE5;
//    RN8209D_WriteReg(WREN,regbuf,1);
//    //写寄存器
//    regbuf[0] = temp/256;regbuf[1] = temp%256;
//    RN8209D_WriteReg(reg_APOSArry[phase],regbuf,2);
//}

