KeeqRight/stm8s103k3_uart1/RN8209D.c
void RN8209D_CalibrateAPOSx(uint8_t phase)
{
    uint8_t regbuf[5];
    uint32_t regtemp[12],regtotal=0;
    const uint16_t regArry[]={Reg_PowerPA,Reg_PowerPB};
    const uint16_t reg_APOSArry[]={Reg_APOSA,Reg_APOSB};
    const uint16_t reg_GPQxArry[]={Reg_GPQA,Reg_GPQB};
    uint8_t i = 0;
    uint16_t temp;
    float gGPQx = 0;
    double k = 0;

    for(i=0;i<12;i++){
        if(RN8209D_ReadReg(regArry[phase],regbuf,4)==0){
            regtemp[i] = (regbuf[0]<<24)+(regbuf[1]<<16)+(regbuf[2]<<8)+(regbuf[3]);
            //求补码
            if(regtemp[i]&0x80000000){
               regtemp[i] = ~regtemp[i];
               regtemp[i] += 1;
            }
        }
        delay_ms(350);
    }
    //第一个数据不要
    for(i=1;i<12;i++){
        regtotal += regtemp[i];
    }
    regtotal /= 11;

    RN8209D_ReadReg(reg_GPQxArry[phase],regbuf,2);
    temp = regbuf[0]*256+regbuf[1];
    if(temp&0x8000)
    {
        gGPQx = (temp-65536)/32768.0;
    }
    else{
        gGPQx = temp/32768.0;
    }

    k = (602299-regtotal)/(1+gGPQx);
    if(k > 0){
        temp = (uint16_t)k;
    }
    else{
        temp = (uint16_t)(k+65536);
    }
    //写使能
    regbuf[0] = 0xE5;
    RN8209D_WriteReg(WREN,regbuf,1);
    //写寄存器
    regbuf[0] = temp/256;regbuf[1] = temp%256;
    RN8209D_WriteReg(reg_APOSArry[phase],regbuf,2);
    if(phase == phase_A){
        StDef_RN8209DPara_Reg.Cst_APOSA = temp;
    }
    else if(phase == phase_B){
        StDef_RN8209DPara_Reg.Cst_APOSB = temp;
    }

}

/********************************************************
功能描述：   计算电流通道offset
参数说明：
返回说明：
调用方式：
全局变量：
读写时间：
注意事项：
日期    ：
********************************************************/
void RN8209D_CalibrateCurrentOffset(uint8_t phase)
{
    uint8_t regbuf[5];
    uint32_t regtemp[12],regtotal=0;
    const uint16_t regArry[]={Reg_IARMS,Reg_IBRMS};
    const uint16_t regIx_OS[]={Reg_IARMSOS,Reg_IBRMSOS};
    uint8_t i = 0;
    uint16_t temp;

    for(i=0;i<12;i++)
    {
        if(RN8209D_ReadReg(regArry[phase],regbuf,3)==0){
            regtemp[i] = (regbuf[0]<<16)+(regbuf[1]<<8)+(regbuf[2]);
        }       
        delay_ms(350);
    }
    //第一个数据不要
    for(i=1;i<12;i++){
        regtotal += regtemp[i];
    }
    regtotal /= 11;
    regtotal = regtotal * regtotal;
    //求反码
    regtotal = ~regtotal;
    temp = (regtotal>>8);
    //符号位
    if(regtotal & 0x80000000)
        temp |= 0x8000;
    //写使能
    regbuf[0] = 0xE5;
    RN8209D_WriteReg(WREN,regbuf,1);
    //写寄存器
    regbuf[0] = temp/256;regbuf[1] = temp%256;
    RN8209D_WriteReg(regIx_OS[phase],regbuf,2);
    if(phase == phase_A){
        StDef_RN8209DPara_Reg.Cst_IARMSOS = temp;
    }
    else if(phase == phase_B){
        StDef_RN8209DPara_Reg.Cst_IBRMSOS = temp;
    }
}

/********************************************************
功能描述：   计算电压、电流显示转换系数
参数说明：
返回说明：
调用方式：
全局变量：
读写时间：
注意事项：
日期    ：
********************************************************/
void RN8209D_CalibrateKx(uint8_t phase)
{
    uint8_t regbuf[3];
    //uint32_t tempValue;
    uint32_t regtemp[12],regtotal=0;
    uint8_t i = 0;

    if(phase == phase_A){
        for(i=0;i<12;i++)
        {
            if(RN8209D_ReadReg(Reg_URMS,regbuf,3)==0){
                regtemp[i] = (regbuf[0]<<16)+(regbuf[1]<<8)+(regbuf[2]);
            }
            delay_ms(350);
        }
        //第一个数据不要
        for(i=1;i<12;i++){
            regtotal += regtemp[i];
        }
        regtotal /= 11;
        StDef_RN8209DPara_Reg.Cst_Ku = regtotal / 220;

        regtotal = 0;

        for(i=0;i<12;i++)
        {
            if(RN8209D_ReadReg(Reg_IARMS,regbuf,3)==0){
                regtemp[i] = (regbuf[0]<<16)+(regbuf[1]<<8)+(regbuf[2]);
            }
            delay_ms(350);
        }
        //第一个数据不要
        for(i=1;i<12;i++){
            regtotal += regtemp[i];
        }
        regtotal /= 11;
        StDef_RN8209DPara_Reg.Cst_Kia = regtotal / 5;
    }
    else if(phase == phase_B){
        for(i=0;i<12;i++)
        {
            if(RN8209D_ReadReg(Reg_URMS,regbuf,3)==0){
                regtemp[i] = (regbuf[0]<<16)+(regbuf[1]<<8)+(regbuf[2]);
            }
            delay_ms(350);
        }
        //第一个数据不要
        for(i=1;i<12;i++){
            regtotal += regtemp[i];
        }
        regtotal /= 11;
        StDef_RN8209DPara_Reg.Cst_Ku = regtotal / 220;

        regtotal = 0;

        for(i=0;i<12;i++)
        {
            if(RN8209D_ReadReg(Reg_IBRMS,regbuf,3)==0){
                regtemp[i] = (regbuf[0]<<16)+(regbuf[1]<<8)+(regbuf[2]);
            }
            delay_ms(350);
        }
        //第一个数据不要
        for(i=1;i<12;i++){
            regtotal += regtemp[i];
        }
        regtotal /= 11;
        StDef_RN8209DPara_Reg.Cst_Kib = regtotal / 5;
    }
}


/********************************************************
功能描述：
参数说明：
返回说明： 扩大10倍
调用方式：
全局变量：
读写时间：
注意事项：
日期    ：
********************************************************/
uint8_t RN8209D_ReadVoltage(uint16_t *vol)
{
    uint8_t  regbuf[3];
    uint32_t tempValue;

    if(RN8209D_ReadReg(Reg_URMS,regbuf,3)==0){
        tempValue = (regbuf[0]<<16)+(regbuf[1]<<8)+(regbuf[2]);
        if(tempValue & 0x800000){
            tempValue = 0;
        }
        else{
            *vol = (uint16_t)(tempValue*10.0/StDef_RN8209DPara_Reg.Cst_Ku);
        }
        return 0;
    }
    
    return 1;
    
}

/********************************************************
功能描述：
参数说明：
返回说明： 扩大1000倍
调用方式：
全局变量：
读写时间：
注意事项：
日期    ：
********************************************************/
uint8_t RN8209D_ReadCurrent(uint8_t phase,uint16_t *current)
{
    uint8_t  regbuf[3];
    uint32_t tempValue;

    if(phase == phase_A){
        if(RN8209D_ReadReg(Reg_IARMS,regbuf,3)==0){
            tempValue = (regbuf[0]<<16)+(regbuf[1]<<8)+(regbuf[2]);
            if(tempValue & 0x800000){
                tempValue = 0;
            }
            else{
                *current = (uint16_t)(tempValue*1000.0/StDef_RN8209DPara_Reg.Cst_Kia);
            }
            return 0;
        }
    }
    else if(phase == phase_B){
        if(RN8209D_ReadReg(Reg_IBRMS,regbuf,3)==0){
            tempValue = (regbuf[0]<<16)+(regbuf[1]<<8)+(regbuf[2]);
            if(tempValue & 0x800000){
                tempValue = 0;
            }
            else{
                *current = (uint16_t)(tempValue*1000.0/StDef_RN8209DPara_Reg.Cst_Kib);
            }
            return 0;
        }
    }
    return 1;
}

/********************************************************
功能描述：   读取有功功率
参数说明：
返回说明：   扩大1000倍
调用方式：
全局变量：
读写时间：
注意事项：
日期    ：
********************************************************/
uint8_t RN8209D_ReadPower(uint8_t phase,uint32_t *p)
{
    uint8_t  regbuf[4];
    uint32_t tempValue;

