KeeqRight/stm8s103k3_uart1/RN8209D.c
    if(phase == phase_A){
        if(RN8209D_ReadReg(Reg_PowerPA,regbuf,4)==0){
            tempValue = (regbuf[0]<<24)+(regbuf[1]<<16)+(regbuf[2]<<8)+(regbuf[3]);
            if(tempValue&0x80000000){
              tempValue = ~tempValue;
              tempValue += 1;
            }
//            if(tempValue>=21903393){
//                *p = (uint32_t)(tempValue*0.0000457);
//            }
//            else if(tempValue<21903393 && tempValue>=2190339){
//                *p = (uint32_t)(tempValue*10*0.0000457);
//            }
//            else if(tempValue<2190339 && tempValue>=219033){
//                *p = (uint32_t)(tempValue*100*0.0000457);
//            }
//            else if(tempValue<219033){
//                *p = (uint32_t)(tempValue*1000*0.0000457);
//            }

            *p = (uint32_t)(tempValue*0.000457);
            return 0;
        }
    }
    else if(phase == phase_B){
        if(RN8209D_ReadReg(Reg_PowerPB,regbuf,4)==0){
            tempValue = (regbuf[0]<<24)+(regbuf[1]<<16)+(regbuf[2]<<8)+(regbuf[3]);
            if(tempValue&0x80000000){
              tempValue = ~tempValue;
              tempValue += 1;
            }
            *p = (uint32_t)(tempValue*0.0000457);
            return 0;
        }
    }
    return 1;
}

/********************************************************
功能描述：   读取累计电量
参数说明：
返回说明：   扩大100倍
调用方式：
全局变量：
读写时间：
注意事项：
日期    ：
********************************************************/
uint8_t RN8209D_ReadTotalE(uint8_t phase,uint32_t *p)
{
    uint8_t  regbuf[3];
    uint32_t tempValue;

    if(phase == phase_A){
        if(RN8209D_ReadReg(Reg_EnergyP,regbuf,3)==0){
            tempValue = (regbuf[0]<<16)+(regbuf[1]<<8)+(regbuf[2]);
            //*p = (uint32_t)(tempValue*100.0/3200);
            *p = tempValue;
            return 0;
        }
    }
    else if(phase == phase_B){
        if(RN8209D_ReadReg(Reg_EnergyD,regbuf,3)==0){
            tempValue = (regbuf[0]<<16)+(regbuf[1]<<8)+(regbuf[2]);
            //*p = (uint32_t)(tempValue*100.0/3200);
            *p = tempValue;
            return 0;
        }
    }
    return 1;
}

/********************************************************
功能描述：   读取校验寄存器
参数说明：
返回说明：
调用方式：
全局变量：
读写时间：
注意事项：
日期    ：
********************************************************/
uint8_t RN8209D_ReadCheckSum(uint32_t *p)
{
    uint8_t  regbuf[3];
    uint32_t tempValue;

    if(RN8209D_ReadReg(Reg_EMUStatus,regbuf,3)==0){
        tempValue = (regbuf[0]<<16)+(regbuf[1]<<8)+(regbuf[2]);
        *p = tempValue;
        return 0;
    }
    return 1;
}

